chore: readme updates
